import json

with open('num_data.json','r') as f:
    json_data=json.load(f)


a=['230805276815693268477716800965460592645712', '108763746041985894137019100254637598993637',
   '288598329321519620854455672520176211383193', '294604254318704980473743']

b=['学肃公新门富三杭凰庆昆人哈充上军拥辽春珠城秦市宿内尔成川夏中友设长封弄业省齐无站西衡',
   '深嘉扬汕创五乐香赣厦广前常乌名云韶石东遵福层和盐澳幸都花谊苏朝北定泉源远建港江浙结红',
   '圳庄治贵宁湖滨林惠保洛解安迁武淮皇阳波龙烟镇河鞍道家区太茂村机郑平六隆鲁锦藏德吉衢邢',
   '一临连利疆梅号金头工场民健体教威京永心义佛年开向沈山康育天桂徽宜街凤曙路津祥淄甘楼环',
   '沿潍陕黑沙关黄四信南湛蒙锡晋进岛才谐木莞昌宾通化主府台银八济古感温十风海明博交放迎合',
   '泰团孝绍九二爱园光乡徐七华农生襄重肇县岳坊胜湾州汾文清汉绵兴振廊青旗大肥冈']

num_list={}
num_list['35']=[i for i in a[0]]
num_list['79']=[i for i in a[1]]
num_list['124']=[i for i in a[2]]
num_list['132']=[i for i in a[3]]

adress_list={}
adress_list['22']=[i for i in b[0]]
adress_list['72']=[i for i in b[1]]
adress_list['119']=[i for i in b[2]]
adress_list['157']=[i for i in b[3]]
adress_list['190']=[i for i in b[4]]
adress_list['222']=[i for i in b[5]]